---
kind: other
id: Properties.T:Autodesk.Revit.DB.TemporaryGraphicsManager
source: html/49b61cb5-b4c7-9dd8-f89d-b57a44c85091.htm
---
# TemporaryGraphicsManager Properties

Specifies whether the .NET object represents a valid Revit entity.